Revit 2027 API
ParameterTypeId.SteelElemProfileLength Property
 "System Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemProfileLength { get; }
Public Shared ReadOnly Property SteelElemProfileLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemProfileLength {
	ForgeTypeId^ get ();
}
static member SteelElemProfileLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace